package project;

public class GameRule {
	
	/* 다이스 룰
	 * 주시위 1 Aces (의 값만 합 계 출력 ex) 1 눈 3개면 -> x3 = 3)
	 * 주시위 2 Deuces
	 * 주시위 3 Threes
	 * 주시위 4 Fours
	 * 주시위 5 Fives
	 * 주시위 6 Sixes
	 * ------------------------------
	 * 서브합계 sub total(보너스) (상단 항목의 점수 합계가 63점 이상일 때, 35점을 추가로 얻는다.)
	 * ------------------------------
	 * 초이스			  (주사위 눈 5개의 총합. 최대 30점)
	 * 4 or Kind	  (동일한 주사위 눈이 4개 이상일 때, 동일한 주사위 눈 4개의 총합. 최대 24점.)
	 * Full House	  (같은 번호 동일한 주사위 눈 한 종류가 3개, 다른 종류가 2개일 때, 주사위 눈 5개의 총합 최대 28점)
	 * 스몰(S) 스트레이트 (주사위 눈이 각각 1,2,3,4 / 2,3,4,5 / 3,4,5,6 일 때 고정 15점)
	 * 라지(L) 스트레이트 (주사위 눈이 각각 1,2,3,4,5 / 2,3,4,5,6 일 때 고정 30점.)
	 * 야추  			  (동일한 주사위 눈이 5개일 때. 고정 50점.)
	 * ------------------------------
	 * 합계 :			  (보너스 + 총 합)
	 * 
	 * */
	

}
